In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
# load files

indeed_file = 'Cleaned_Indeed_prior2ZipJoin.csv'
dice_file = 'clean_dice_data.csv'


df_in = pd.read_csv(indeed_file, encoding="ISO-8859-1")
df_d = pd.read_csv(dice_file, encoding="ISO-8859-1")

In [3]:
df_in.head()

         position         company     City State
0  Data Scientist  Xpert Staffing  ATLANTA    GA
1    Data Analyst  Operation HOPE  ATLANTA    GA
2  Data Scientist        Cotiviti  ATLANTA    GA
3  Data Scientist     Relus Cloud  ATLANTA    GA
4  Data Scientist  Inspire Brands  ATLANTA    GA

In [8]:
#rename columns

df_in.rename(columns={'position': 'Job Title', 'company': 'Company', 'City': 'City', 'State' : 'State'}, inplace=True)

df_in.head()

        Job Title         Company     City State
0  Data Scientist  Xpert Staffing  ATLANTA    GA
1    Data Analyst  Operation HOPE  ATLANTA    GA
2  Data Scientist        Cotiviti  ATLANTA    GA
3  Data Scientist     Relus Cloud  ATLANTA    GA
4  Data Scientist  Inspire Brands  ATLANTA    GA

In [9]:
# Select specific columns

df_d = df_d[['Job Title', 'Company', 'City', 'State']]
df_d.head()

,Job Title,Company,City,State
0,AUTOMATION TEST ENGINEER,"Digital Intelligence Systems, LLC",Atlanta,GA
1,Information Security Engineer,University of Chicago/IT Services,Chicago,IL
2,Business Solutions Architect,"Galaxy Systems, Inc.",Schaumburg,IL
3,"Java Developer (mid level)- FT- GREAT culture,...",TransTech LLC,Bolingbrook,IL
4,DevOps Engineer,Matrix Resources,Atlanta,GA

In [10]:
df = pd.DataFrame

In [12]:
frames = [df_in, df_d]

result = pd.concat(frames)

In [13]:
result.head()

        Job Title         Company     City State
0  Data Scientist  Xpert Staffing  ATLANTA    GA
1    Data Analyst  Operation HOPE  ATLANTA    GA
2  Data Scientist        Cotiviti  ATLANTA    GA
3  Data Scientist     Relus Cloud  ATLANTA    GA
4  Data Scientist  Inspire Brands  ATLANTA    GA

In [16]:
df_in.shape

(955, 4)

In [17]:
df_d.shape

(21932, 4)

In [18]:
result.shape

(22887, 4)

In [19]:
# Save cleaned data to csv

result.to_csv("Append_Final.csv", index=False)